// Task-2-7-b-ru.cpp : Этот файл содержит функцию 'main'.
// Выполнение программы начинается и заканчивается здесь.
//
#include <iostream>
#include <locale>
#include <string>
#include <math.h>
#include <algorithm>

int main(int argc, char *argv[])
{
    // Ввод данных: целевой и текущий код
    // вводятся как четырехзначные числа
    int total_moves = 0; // Счётчик ходов
    int a, a1; // число текущего кода
    int b, b1; // число целевого кода
    int m = 0; // Количество цифр текущего кода
    int n = 0; // Количество цифр целевого кода
    // Установка русской локали для терминала Windows 11
    // 1-й способ. Выплнить внешнюю команду.
    system("chcp 65001 >nul");
    // 2 - й способ. Вызов библиотечной функции.
    setlocale(LC_ALL, "russian.65001");
    // 3 - й способ. Создать переменную типа локали.
    std::locale rus_locale = std::locale("russian.65001");
    // 3 - й способ. Выбор кодировки(локали) терминала
    std::cout.imbue(std::locale::global(rus_locale));
    // Чтение входных данных
    std::cout << "Введите текущий код: ";
    std::cin >> a;
    std::cout << "Введите целевой код: ";
    std::cin >> b;
    n = 0;  // Количесво цифр текущего кода
    a1 = a;
    b1 = b;
    // Количество цифр текущего кода
    while (a1 > 0)
    {
        m += 1; // Вычислить количества цифр числа.
        a1 /= 10; // Число уменьшить в 10 раз.
    }
    // Количество цифр целевого кода
    while (b1 > 0)
    {
        n += 1; // Вычислить количества цифр числа.
        b1 /= 10; // Число уменьшить в 10 раз.
    }
    // Проверка на совпадение длины текущего и целевого кода
    // Если длина текущего кода не равна длине целевого
    // и оба кода не четырёхзначные, программа завершает работу.
    if ((m != 4) || (n != 4) || (m != n))
    {
        std::cout << "Комбинация кодового замка должна быть 4 цифры.";
        std::cout << "Текущий и целевой код должны быть одинаковой длины.";
        return 0;
    }
    a1 = a;
    b1 = b;
    // Перебор цифр текущего и целевого кода
    while ((a1 > 0) && (b1 > 0))
    {
        int d1 = a1 % 10;  // Цифра текущего кода
        int d2 = b1 % 10;  // Цифра целевого кода
        int diff1 = abs(d1 - d2);  // разность цифр, прямой ход диска
        int diff2 = 10 - abs(d1 - d2);  // разность цифр, обратный ход диска
        // Мнинимальное число ходов - разность между каждой цифрой диска
        // в целевом коде и текущем коде замка сейфа
        total_moves += std::min(diff1, diff2);
        a1 /= 10;  // Переход к следующей цифре текущего кода
        b1 /= 10;  // Переход к следующей цифре целевого кода
    }
    // Вывод информации на экран
    std::cout << "Текущий код:" << a << "\r\n";
    std::cout << "Целевой код:" << b << "\r\n";
    std::cout << "Мнинимальное число ходов:" << total_moves << "\r\n";
    return 0;
}

// Запуск программы: Ctrl + F5 или меню «Отладка» > «Запустить без отладки»
// Отладка программы: F5 или меню «Отладка» > «Запустить отладку»
// Советы по началу работы:
// 1. Используйте окно «Обозреватель решений» для добавления/управления файлами
// 2. Используйте окно «Обозреватель команд» для подключения к системе контроля версий
// 3. Используйте окно «Вывод», чтобы просмотреть результаты сборки и другие сообщения
// 4. Используйте окно «Список ошибок», чтобы просмотреть ошибки
// 5. Перейдите в меню «Проект» > «Добавить новый элемент», чтобы создать новые файлы кода, 
//    или в меню «Проект» > «Добавить существующий элемент», 
// чтобы добавить существующие файлы кода в проект